Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/forwarding-refs_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: forwarding-refs title: Forwarding Refs permalink: docs/forwarding-refs.html ---
ja: --- id: forwarding-refs title: ref のフォワーディング permalink: docs/forwarding-refs.html ---

source: Ref forwarding is a technique for automatically passing a [ref](/docs/refs-and-the-dom.html) through a component to one of its children.
ja: ref のフォワーディングはあるコンポーネントを通じてその子コンポーネントのひとつに [ref](/docs/refs-and-the-dom.html) を自動的に渡すテクニックです。

source: This is typically not necessary for most components in the application.
ja: これは基本的にはアプリケーション内のほとんどのコンポーネントで必要ありません。

source: However, it can be useful for some kinds of components, especially in reusable component libraries.
ja: しかし、コンポーネントの種類によっては、特に再利用可能なコンポーネントライブラリにおいては、便利なものとなるかもしれません。

source: The most common scenarios are described below.
ja: 一般的なシナリオについて以下で述べます。

source: ## Forwarding refs to DOM components {#forwarding-refs-to-dom-components}
ja: ## DOM コンポーネントに ref をフォワーディングする {#forwarding-refs-to-dom-components}

source: Consider a `FancyButton` component that renders the native `button` DOM element: `embed:forwarding-refs/fancy-button-simple.js`
ja: ネイティブの `button` DOM 要素をレンダーする `FancyButton` というコンポーネントを考えてみましょう： `embed:forwarding-refs/fancy-button-simple.js`

source: React components hide their implementation details, including their rendered output.
ja: React コンポーネントは、レンダーの結果も含め、実装の詳細を隠蔽します。

source: Other components using `FancyButton` **usually will not need to** [obtain a ref](/docs/refs-and-the-dom.html) to the inner `button` DOM element.
ja: `FancyButton` を使用する他のコンポーネントは内側の `button` DOM 要素に対する [ref を取得する](/docs/refs-and-the-dom.html)**必要は通常ありません** 。

source: This is good because it prevents components from relying on each other's DOM structure too much.
ja: これは、互いのコンポーネントの DOM 構造に過剰に依存することを防ぐので、良いことです。

source: Although such encapsulation is desirable for application-level components like `FeedStory` or `Comment`, it can be inconvenient for highly reusable "leaf" components like `FancyButton` or `MyTextInput`.
ja: そういったカプセル化は `FeedStory` や `Comment` のようなアプリケーションレベルのコンポーネントでは望ましいことではありますが、`FancyButton` や `MyTextInput` といった非常に多くのところで再利用可能な "末梢の" コンポーネントでは不便である可能性があります。

source: These components tend to be used throughout the application in a similar manner as a regular DOM `button` and `input`, and accessing their DOM nodes may be unavoidable for managing focus, selection, or animations.
ja: このようなコンポーネントは、アプリケーションのいたるところで通常の DOM である `button` や `input` と同様に扱われる傾向にあり、フォーカス、要素の選択、アニメーションをこなすにはそれら DOM ノードにアクセスすることが避けられないかもしれません。

source: **Ref forwarding is an opt-in feature that lets some components take a `ref` they receive, and pass it further down (in other words, "forward" it) to a child.**
ja: **ref のフォワーディングはオプトインの機能であり、それにより、コンポーネントが `ref` を受け取って、それをさらに下層の子に渡せる（つまり、ref を "転送" できる）ようになります。**

source: In the example below, `FancyButton` uses `React.forwardRef` to obtain the `ref` passed to it, and then forward it to the DOM `button` that it renders:
ja: 下の例では、`FancyButton` は渡された `ref` を取得して、それをレンダーする `button` DOM にフォワーディングするために、`React.forwardRef` を使っています。

source: This way, components using `FancyButton` can get a ref to the underlying `button` DOM node and access it if necessary—just like if they used a DOM `button` directly.
ja: このように、`FancyButton` を使ったコンポーネントは下層の `button` DOM ノードの ref を取得することができ、必要であれば `button` DOM を直接使うかのように、DOM にアクセスすることができます。

source: Here is a step-by-step explanation of what happens in the above example:
ja: 上の例で、何が起こっているかを順々に説明します。

source: We create a [React ref](/docs/refs-and-the-dom.html) by calling `React.createRef` and assign it to a `ref` variable.
ja: `React.createRef` を呼び、[React ref](/docs/refs-and-the-dom.html) をつくり、それを `ref` 変数に代入します。

source: We pass our `ref` down to `<FancyButton ref={ref}>` by specifying it as a JSX attribute.
ja: `ref` を `<FancyButton ref={ref}>` に JSX の属性として指定することで渡します。

source: React passes the `ref` to the `(props, ref) => ...` function inside `forwardRef` as a second argument.
ja: React は `ref` を、`forwardRef` 内の関数 `(props, ref) => ...` の 2 番目の引数として渡します。

source: We forward this `ref` argument down to `<button ref={ref}>` by specifying it as a JSX attribute.
ja: この引数として受け取った `ref` を `<button ref={ref}>` に JSX の属性として指定することで渡します。

source: When the ref is attached, `ref.current` will point to the `<button>` DOM node.
ja: この ref が紐付けられると、`ref.current` は `<button>` DOM ノードのことを指すようになります。

source: >Note > >The second `ref` argument only exists when you define a component with `React.forwardRef` call.
ja: >補足 > > 2 番目の引数 `ref` は `React.forwardRef` の呼び出しを使ってコンポーネントを定義したときにだけ存在します。

source: Regular function or class components don't receive the `ref` argument, and ref is not available in props either.
ja: 通常の関数またはクラスコンポーネントは `ref` 引数を受け取らず、ref は props からも利用できません。

source: > >Ref forwarding is not limited to DOM components.
ja: > > ref のフォワーディング先は DOM コンポーネントだけにとどまりません。

source: You can forward refs to class component instances, too.
ja: クラスコンポーネントインスタンスに対しても ref をフォワーディングできます。

source: ## Note for component library maintainers {#note-for-component-library-maintainers}
ja: ## コンポーネントライブラリのメンテナ向けの補足 {#note-for-component-library-maintainers}

source: **When you start using `forwardRef` in a component library, you should treat it as a breaking change and release a new major version of your library.
ja: **コンポーネントライブラリの中で、`forwardRef` を使い始めた場合、破壊的変更として扱い、新しいメジャーバージョンをリリースすべきです。

source: ** This is because your library likely has an observably different behavior (such as what refs get assigned to, and what types are exported), and this can break apps and other libraries that depend on the old behavior.
ja: **ライブラリが外から見て今までと違う挙動（例えば、どの値が ref に代入されるかや、どの型がエクスポートされるのか）をする可能性があり、古い挙動に依存しているアプリケーションや他のライブラリを壊す可能性があるからです。

source: Conditionally applying `React.forwardRef` when it exists is also not recommended for the same reasons: it changes how your library behaves and can break your users' apps when they upgrade React itself.
ja: `React.forwardRef` が存在する場合だけ、条件的に `React.forwardRef` を適用することも同じ理由で推奨されません：そのような実装は、React そのものを更新したとき、ライブラリがどのように振る舞うかを変えてしまい、ユーザのアプリケーションを破壊する可能性があるからです。

source: ## Forwarding refs in higher-order components {#forwarding-refs-in-higher-order-components}
ja: ## 高階コンポーネントにおける ref のフォワーディング {#forwarding-refs-in-higher-order-components}

source: This technique can also be particularly useful with [higher-order components](/docs/higher-order-components.html) (also known as HOCs).
ja: このテクニックは[高階コンポーネント](/docs/higher-order-components.html)（HOC としても知られています）においても特に便利です。

source: Let's start with an example HOC that logs component props to the console: `embed:forwarding-refs/log-props-before.js`
ja: コンポーネントの props をコンソールにログ出力する HOC を例として考えてみましょう。`embed:forwarding-refs/log-props-before.js`

source: The "logProps" HOC passes all `props` through to the component it wraps, so the rendered output will be the same.
ja: "logProps" HOC はすべての `props` をラップするコンポーネントに渡すので、レンダーされる出力は同じになるでしょう。

source: For example, we can use this HOC to log all props that get passed to our "fancy button" component: `embed:forwarding-refs/fancy-button.js`
ja: 例えば、"fancy button" コンポーネントに渡されるすべての props をログとして記録するために、この HOC を使用することができます。`embed:forwarding-refs/fancy-button.js`

source: There is one caveat to the above example: refs will not get passed through.
ja: ところが上記の例には欠陥があります。これでは ref が渡されないのです。

source: That's because `ref` is not a prop.
ja: `ref` は props のひとつではないからです。

source: Like `key`, it's handled differently by React.
ja: `key` と同様に ref は React では props とは違う扱いになります。

source: If you add a ref to a HOC, the ref will refer to the outermost container component, not the wrapped component.
ja: HOC に対する ref を追加した場合、ラップされたコンポーネントではなく、一番外側のコンテナコンポーネントを参照します。

source: This means that refs intended for our `FancyButton` component will actually be attached to the `LogProps` component: `embed:forwarding-refs/fancy-button-ref.js`
ja: これは `FancyButton` コンポーネントに紐付けられることを意図した ref が、実際には `LogProps` コンポーネントに紐付けられてしまうことを意味します。`embed:forwarding-refs/fancy-button-ref.js`

source: Fortunately, we can explicitly forward refs to the inner `FancyButton` component using the `React.forwardRef` API.
ja: 幸いにも、`React.forwardRef` API を使って、内側の `FancyButton` コンポーネントに対して ref を明示的に転送することができます。

source: `React.forwardRef` accepts a render function that receives `props` and `ref` parameters and returns a React node.
ja: `React.forwardRef` は render 関数を受け取り、その関数は `props` と `ref` を引数として取り、React ノードを返します。

source: For example: `embed:forwarding-refs/log-props-after.js`
ja: 例えば、 `embed:forwarding-refs/log-props-after.js`

source: ## Displaying a custom name in DevTools {#displaying-a-custom-name-in-devtools}
ja: ## DevTools でのカスタム名表示 {#displaying-a-custom-name-in-devtools}

source: `React.forwardRef` accepts a render function.
ja: `React.forwardRef` は render 関数を受け取ります。

source: React DevTools uses this function to determine what to display for the ref forwarding component.
ja: React DevTools は ref をフォワーディングしているコンポーネントとして何を表示すべきかを決定するために、この関数を使います。

source: For example, the following component will appear as "*ForwardRef*" in the DevTools:
ja: 例えば、次のコンポーネントは "*ForwardRef*" として DevTools に表示されます。

source: If you name the render function, DevTools will also include its name (e.g. "*ForwardRef(myFunction)*"):
ja: render 関数に名前をつけると、DevTools はその名前を含めるようになります（例： "*ForwardRef(myFunction)*"）：

source: You can even set the function's `displayName` property to include the component you're wrapping:
ja: ラップしているコンポーネントを含めるために、render 関数の `displayName` を設定することもできます：
